{
  "personal_details": {
    "first_name": "Behnam",
    "last_name": "Ebrahimy",
    "role": "Senior Front-End Developer",
    "web_site_url": "",
    "address": "Tehran, Iran",
    "stack": "JS"
  },
  "social_networks": [
    {
      "id": "1",
      "name": "Linkedin",
      "link": "https://linkedin.com/in/behnam-ebrahimy",
      "displayName": "Behnam Ebrahimy"
    },
    {
      "id": "2",
      "name": "Git Hub",
      "link": "https://github.com/behy75",
      "displayName": "Behnam Ebrahimy"
    },
    {
      "id": "3",
      "name": "Email",
      "link": "mailto:bebrahimy19@gmail.com",
      "displayName": "Bebrahimy19@gmail.com"
    },
    {
      "id": "4",
      "name": "Phone",
      "link": "tel:+989186393984",
      "displayName": "+98(918)6393984"
    },
    {
      "id": "5",
      "name": "Website URL",
      "link": "",
      "displayName": ""
    }
  ],
  "summary":  "As a front-end developer, I bring over 5 years of expertise in React JS development. I have a strong track record of seamlessly collaborating with diverse teams, whether in small or larger groups of up to 10 members. With valuable contributions to over 5 projects, I consistently deliver top-notch solutions. My commitment to promoting teamwork and innovation, allows me to excel in vibrant environments where collaboration is paramount.",
  "colleges": [
    {
      "id": "1",
      "nameOfCollege": "University Of Tehran",
      "arrivalDate": "Nov 2020",
      "departureDate": "Feb 2024",
      "field": "Master of Engineering",
      "major": "Mining Engineering",
      "minor": "Mineral extraction",
      "grade": "",
      "skills": [
        "Research",
        "Analysis",
        "Critical Thinking",
        "Communication"
      ]
    },
    {
      "id": "2",
      "nameOfCollege": "Isfahan University Of Technology",
      "arrivalDate": "Jan 2015",
      "departureDate": "May 2019",
      "field": "Bachelor of Engineering",
      "major": "Mining Engineering",
      "minor": "Rock Mechanics",
      "grade": "",
      "skills": [
        "Programming",
        "Algorithms",
        "Data Structures",
        "Software Development"
      ]
    }
  ],
  "skills": [
    "Web-Design",
    "HTML5",
    "CSS3",
    "JavaScript",
    "TypeScript",
    "React.js",
    "Clean-Code",
    "NoSQL",
    "Design-Pattern",
    "Next.js",
    "PWA",
    "Webpack&babel",
    "Tailwind",
    "UI/UX",
    "Rest-API’s",
    "Redux",
    "React-Query",
    "Zustand",
    "Socket.IO",
    "Test",
    "Solidity",
    "Web3",
    "React-Native",
    "Vue.js",
    "Socket.IO",
    "Node.js",
    "Express.js",
    "MongoDB",
    "MySQL",
    "AI-Chat"
  ],
  "experiences": [
    {
      "id": "1",
      "role": "Senior Front-End Developer",
      "websiteURL": "https://www.workmap.ai/",
      "arrivalDate": "Jan 2022",
      "departureDate": "Present",
      "nameOfCompany": "HyperOffice Company",
      "activities": [
        "Led the development team in implementing Workmap's advanced data visualization tools, real-time analytics, and reporting features; boosted user experience and increased data management efficiency for clients.",
        "Orchestrated the integration of AI Chat tools powered by OpenAI, accelerating the creation of data grids, applications, and columns threefold, leading to a 50% boost in productivity and operational efficiency.",
        "Integrated Stripe payment system, driving a 25% increase in client transaction processing speed and a 15% rise in company revenue through boosted payment processing.",
        "Utilized React-to-Print and React-PDF libraries to optimize the printing workflow of data grids and forms, leading to a remarkable 40% acceleration in clients PDF creation process."
      ]
    },
    {
      "id": "2",
      "role": "Senior Front-End Developer",
      "websiteURL": "https://nireeka.com/",
      "arrivalDate": "Sep 2021",
      "departureDate": "Jun 2022",
      "nameOfCompany": "Nireeka Company",
      "activities": [
        "Designed and developed a bespoke bicycle website with comprehensive tracking capabilities for users bike performance.",
        "Boosted user experience with an expansive catalog featuring detailed specifications, features, and pricing information.",
        "Fostered a vibrant social community allowing enthusiasts to interact, troubleshoot, and exchange biking insights.",
        "Implemented an intuitive admin panel enabling seamless addition of new products and efficient order management for bike vendors.",
        "After the website launch, realized a 50% surge in sales attributed to its exceptional performance and SEO optimization.",
        "As a result of the forums effective design, client engagement increased by 30%, fostering a more vibrant community interaction."
      ]
    },
    {
      "id": "3",
      "role": "Front-End Developer",
      "arrivalDate": "Aug 2019",
      "departureDate": "May 2021",
      "nameOfCompany": "Dr. Serita Dental Clinic",
      "activities": [
        "Spearheaded the development of Progressive Web Applications (PWAs) customized for the dental sector, enabling easy access comprehensive dental information.",
        "Designed PWAs to seamlessly operate offline, with device installation capabilities, and native-like experiences.",
        "Boosted accessibility and efficiency in dental care delivery through offline operation and intuitive design.",
        "Implemented a user-centric interface, intuitive navigation, and seamless functionality for a superior user experience.",
        "Following the implementation of the applications, patient satisfaction saw a notable uptick of 20%, paralleled by a 15% increase in employee satisfaction levels.",
        "As a result of developing the web application for cost estimation of dental procedures and patient condition assessment, there was a significant enhancement of 50% in visit efficiency."
      ]
    },
    {
      "id": "4",
      "role": "Junior Front-End Developer",
      "arrivalDate": "Feb 2018",
      "departureDate": "Aug 2019",
      "nameOfCompany": "Talaryab",
      "activities": [
        "Developed a fluent platform facilitating seamless booking of accommodations, encompassing hotels, conference halls, and diverse venues.",
        "Provided travelers with a comprehensive one-stop solution for booking their ideal stay, offering search filters based on location, price range, and amenities.",
        "Incorporated ratings and reviews from previous guests to aid travelers in making informed decisions."
      ]
    }
  ]
}